load-test.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 5
scenarios:
  - flow:
      - post:
          url: "/api/reports/generate"
          headers:
            Content-Type: "application/json"
            Idempotency-Key: "test-{{ () }}"
          json:
            type: "PRUEBA_CARGA"
            userId: "tester"